IDEA Open Model
MatPrestressSteel Class
Compatible with IDEA StatiCa 20.1
 Material prestressing steel base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatPrestressSteel
 IdeaRS.OpenModel.Material.MatPrestressSteelEc2
 IdeaRS.OpenModel.Material.MatPrestressSteelSIA
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class MatPrestressSteel : Material
Public MustInherit Class MatPrestressSteel
	Inherits Material
The MatPrestressSteel type exposes the following members.
Constructors
Name | Description
MatPrestressSteel
Initializes a new instance of the MatPrestressSteel class
Top
Properties
Name | Description
Area
 Area
Diameter
 Diameter
E
 Young's modulus
 (Inherited from Material.)
EquivalentDiameter
 Equivalent diameter
G
 Shear modulus
 (Inherited from Material.)
Id
 Element Id
 (Inherited from OpenElementId.)
IsDefaultMaterial
 True if material is default material from the code
 (Inherited from Material.)
LoadFromLibrary
 Load from library - try override properties from library find material by name
 (Inherited from Material.)
Name
 Name of material
 (Inherited from Material.)
NumberOfWires
 number of wires in strand
OrderInCode
 Order of this material in the code
 (Inherited from Material.)
Poisson
 Poisson's ratio
 (Inherited from Material.)
SpecificHeat
 Specific heat capacity
 (Inherited from Material.)
StateOfThermalConductivity
 State of thermal conductivity curvature
 (Inherited from Material.)
StateOfThermalExpansion
 State of thermal expansion curvature
 (Inherited from Material.)
StateOfThermalSpecificHeat
 State of thermal specific heat curvature
 (Inherited from Material.)
StateOfThermalStrain
 State of thermal strain curvature
 (Inherited from Material.)
StateOfThermalStressStrain
 State of thermal specific stress-strain curvature
 (Inherited from Material.)
ThermalConductivity
 Thermal conductivity
 (Inherited from Material.)
ThermalExpansion
 Thermal expansion
 (Inherited from Material.)
UnitMass
 Unit weight
 (Inherited from Material.)
UserThermalConductivityCurvature
 User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
 (Inherited from Material.)
UserThermalExpansionCurvature
 User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
 (Inherited from Material.)
UserThermalSpecificHeatCurvature
 User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
 (Inherited from Material.)
UserThermalStrainCurvature
 User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
 (Inherited from Material.)
UserThermalStressStrainCurvature
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
 (Inherited from Material.)
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace